#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jonasfost/prod-aws-infrastructure/runs/run-vcDaEKDmprqk5c2B

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
data.aws_acm_certificate.johnyfoster_ssl_cert: Refreshing...
data.aws_ami.packer_ubuntu: Refreshing...
data.aws_ami.ubuntu_20: Refreshing...
data.aws_acm_certificate.prod_johnyfoster_ssl_cert: Refreshing...
data.aws_route53_zone.johnyfoster_zone: Refreshing...
module.asg.data.aws_default_tags.current: Refreshing...
data.aws_availability_zones.available: Refreshing...
data.aws_iam_instance_profile.base_role: Refreshing...
module.asg.data.aws_partition.current: Refreshing...
module.asg.data.aws_default_tags.current: Refresh complete after 0s [id=aws]
module.asg.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.bastion_host.data.aws_partition.current: Refreshing...
module.bastion_host.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_iam_instance_profile.base_role: Refresh complete after 0s [id=AIPAWM6UBSEYXT46S6I4E]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-2]
data.aws_ami.ubuntu_20: Refresh complete after 1s [id=ami-073e5edf4b5d15fc8]
data.aws_acm_certificate.johnyfoster_ssl_cert: Refresh complete after 1s [id=arn:aws:acm:us-east-2:440141975857:certificate/d4cb2c07-c3c7-41fc-88e1-db5ca5e714c7]
data.aws_acm_certificate.prod_johnyfoster_ssl_cert: Refresh complete after 1s [id=arn:aws:acm:us-east-2:440141975857:certificate/08bca4eb-85f5-4009-a439-24a2ed41529f]
data.aws_route53_zone.johnyfoster_zone: Refresh complete after 1s [id=Z00371921B4QSPVT5RTR0]
data.aws_ami.packer_ubuntu: Refresh complete after 1s [id=ami-069b32d282ffea017]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.prod will be created
  + resource "aws_route53_record" "prod" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "prod.johnyfoster.com"
      + type            = "A"
      + zone_id         = "Z00371921B4QSPVT5RTR0"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.www_prod will be created
  + resource "aws_route53_record" "www_prod" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.prod.johnyfoster.com"
      + type            = "A"
      + zone_id         = "Z00371921B4QSPVT5RTR0"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = true
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = "prod-lb"
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lb"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                    = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lb"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-2:440141975857:certificate/08bca4eb-85f5-4009-a439-24a2ed41529f"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_listener_rule.https_listener_rule[0] will be created
  + resource "aws_lb_listener_rule" "https_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "prod.johnyfoster.com",
                  + "www.prod.johnyfoster.com",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = "false"
      + name                               = "prod-80-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment"  = "prod"
          + "Name"         = "prod-80-tg"
          + "Provisionner" = "Terraform"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-80-tg"
          + "Provisionner" = "Terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 10
          + matcher             = "200-399"
          + path                = "/health.html"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.asg.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + default_instance_warmup          = 300
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "prod-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "0"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "prod"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-web-server"
        }
      + tag {
          + key                 = "Provisionner"
          + propagate_at_launch = true
          + value               = "Terraform"
        }

      + timeouts {}
    }

  # module.asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Prod launch template"
      + id                     = (known after apply)
      + image_id               = "ami-073e5edf4b5d15fc8"
      + instance_type          = "t2.micro"
      + key_name               = "main-us-east-2"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "prod-lt-"
      + tags                   = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lt"
          + "Provisionner" = "Terraform"
        }
      + tags_all               = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lt"
          + "Provisionner" = "Terraform"
        }
      + update_default_version = true
      + user_data              = "SXlFdlltbHVMMkpoYzJnS0NpTlZibWx1YzNSaGJHd2dWVzV2Wm1acFkybGhiQ0IyWlhKemFXOXVjeUFLQ21admNpQndhMmNnYVc0Z1pHOWphMlZ5TG1sdklHUnZZMnRsY2kxa2IyTWdaRzlqYTJWeUxXTnZiWEJ2YzJVZ1pHOWphMlZ5TFdOdmJYQnZjMlV0ZGpJZ2NHOWtiV0Z1TFdSdlkydGxjaUJqYjI1MFlXbHVaWEprSUhKMWJtTTdJR1J2SUhOMVpHOGdZWEIwSUhKbGJXOTJaU0FrY0d0bklDMTVPeUJrYjI1bENnb2pJeU1qSXlNakl5TWpJeU1qSXlNakl5TWpJeU1qSXlNakl5TWpJeU1qSXlNaklDQlRaWFFnZFhBZ1JHOWphMlZ5SjNNZ1FYQjBJSEpsY0c5emFYUnZjbmt1SUNNakl5TWpJeU1qSXlNakl5TWpJeU1qSXlNakl5TWpJeU1qSXdvS0l5QkJaR1FnUkc5amEyVnlKM01nYjJabWFXTnBZV3dnUjFCSElHdGxlVG9LYzNWa2J5QmhjSFF0WjJWMElIVndaR0YwWlNBdGVRcHpkV1J2SUdGd2RDMW5aWFFnYVc1emRHRnNiQ0JqWVMxalpYSjBhV1pwWTJGMFpYTWdZM1Z5YkNCbmJuVndaeUF0ZVFwemRXUnZJR2x1YzNSaGJHd2dMVzBnTURjMU5TQXRaQ0F2WlhSakwyRndkQzlyWlhseWFXNW5jd3BqZFhKc0lDMW1jMU5NSUdoMGRIQnpPaTh2Wkc5M2JteHZZV1F1Wkc5amEyVnlMbU52YlM5c2FXNTFlQzkxWW5WdWRIVXZaM0JuSUh3Z2MzVmtieUJuY0djZ0xTMWtaV0Z5Ylc5eUlDMXZJQzlsZEdNdllYQjBMMnRsZVhKcGJtZHpMMlJ2WTJ0bGNpNW5jR2NLYzNWa2J5QmphRzF2WkNCaEszSWdMMlYwWXk5aGNIUXZhMlY1Y21sdVozTXZaRzlqYTJWeUxtZHdaeUFLQ2lNZ1FXUmtJSFJvWlNCeVpYQnZjMmwwYjNKNUlIUnZJRUZ3ZENCemIzVnlZMlZ6T2dwbFkyaHZJRndLSUNBaVpHVmlJRnRoY21Ob1BTSWtLR1J3YTJjZ0xTMXdjbWx1ZEMxaGNtTm9hWFJsWTNSMWNtVXBJaUJ6YVdkdVpXUXRZbms5TDJWMFl5OWhjSFF2YTJWNWNtbHVaM012Wkc5amEyVnlMbWR3WjEwZ2FIUjBjSE02THk5a2IzZHViRzloWkM1a2IyTnJaWEl1WTI5dEwyeHBiblY0TDNWaWRXNTBkU0JjQ2lBZ0lpUW9MaUF2WlhSakwyOXpMWEpsYkdWaGMyVWdKaVlnWldOb2J5QWlKRlpGVWxOSlQwNWZRMDlFUlU1QlRVVWlLU0lnYzNSaFlteGxJaUI4SUZ3S0lDQnpkV1J2SUhSbFpTQXZaWFJqTDJGd2RDOXpiM1Z5WTJWekxteHBjM1F1WkM5a2IyTnJaWEl1YkdsemRDQStJQzlrWlhZdmJuVnNiQXB6ZFdSdklHRndkQzFuWlhRZ2RYQmtZWFJsSUMxNUNnb2phVzV6ZEdGc2JDQjBhR1VnUkc5amEyVnlJSEJoWTJ0aFoyVnpMaUFLQ25OMVpHOGdZWEIwTFdkbGRDQnBibk4wWVd4c0lHUnZZMnRsY2kxalpTQmtiMk5yWlhJdFkyVXRZMnhwSUdOdmJuUmhhVzVsY21RdWFXOGdaRzlqYTJWeUxXSjFhV3hrZUMxd2JIVm5hVzRnWkc5amEyVnlMV052YlhCdmMyVXRjR3gxWjJsdUlDMTVDZ29qSUZOMFlYSjBJR0Z1WkNCRmJtRmliR1VnUkc5amEyVnlJQXB6ZFdSdklITmxjblpwWTJVZ1pHOWphMlZ5SUhOMFlYSjBDbk4xWkc4Z2MyVnlkbWxqWlNCa2IyTnJaWElnWlc1aFlteGxDZ29qUVdSa0lIVnpaWElnWTNsaVpYSWdkRzhnWkc5amEyVnlJR2R5YjNWd0lHRnVaQ0JWY0dSaGRHVWdSRzlqYTJWeUlGQmxjbTFwYzNOcGIyNGdDbk4xWkc4Z2RYTmxjbTF2WkNBdFlTQXRSeUJrYjJOclpYSWdZM2xpWlhJS2MzVmtieUJqYUcxdlpDQTJOallnTDNaaGNpOXlkVzR2Wkc5amEyVnlMbk52WTJzS0NpTWdVblZ1SUU5WFFWTlFJRXAxYVdObElGTm9iM0FnUTI5dWRHRnBibVZ5Q2dwa2IyTnJaWElnY0hWc2JDQmlhMmx0YldsdWFXTm9MMnAxYVdObExYTm9iM0FLWkc5amEyVnlJSEoxYmlBdFpDQXRjQ0E0TURvek1EQXdJR0pyYVcxdGFXNXBZMmd2YW5WcFkyVXRjMmh2Y0E9PQ=="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = "arn:aws:iam::440141975857:instance-profile/ec2-base-role"
        }

      + maintenance_options {
          + auto_recovery = "default"
        }

      + monitoring {
          + enabled = true
        }
    }

  # module.bastion_host.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-073e5edf4b5d15fc8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ec2-base-role"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main-us-east-2"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment"  = "prod"
          + "Name"         = "prod-bastion"
          + "Provisionner" = "Terraform"
        }
      + tags_all                             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-bastion"
          + "Provisionner" = "Terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "3d75ec5cca37e704a4bda20f19ee93bcc0cf079e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "bastion host"
        }
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.bastion_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Allow SSH traffic from Public"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bastion-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"         = "prod"
          + "Name"        = "prod-bastion-sg"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Env"         = "prod"
          + "Name"        = "prod-bastion-sg"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.bastion_sg.aws_security_group_rule.egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Allows SSH traffic to Private Subnet"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # module.bastion_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows SSH traffic from Everywhere IPV4"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.bastion_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "Allows SSH traffic from Everywhere IPV6"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.eip.aws_eip.eip will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = "amazon"
      + tags                 = {
          + "Environment"  = "prod"
          + "Name"         = "prod-bastion-eip"
          + "Provisionner" = "Terraform"
        }
      + tags_all             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-bastion-eip"
          + "Provisionner" = "Terraform"
        }
      + vpc                  = (known after apply)
    }

  # module.private_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and HTTPS from Public"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "private-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"         = "prod"
          + "Name"        = "prod-private-sg"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Env"         = "prod"
          + "Name"        = "prod-private-sg"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.private_sg.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows All traffic to anywhere IPV4"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.private_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      + description              = "Allows All traffic to anywhere IPV6"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.private_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Allows HTTP from Public SG"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group_rule.ingress_with_source_security_group_id[1] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Allows HTTPS from Public SG"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group_rule.ingress_with_source_security_group_id[2] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Allows SSH from Private SG"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Allows HTTP and HTTPS from Public"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "public-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"         = "prod"
          + "Name"        = "prod-public-sg"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Env"         = "prod"
          + "Name"        = "prod-public-sg"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.public_sg.aws_security_group_rule.egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Allows HTTP traffic to Private Subnet"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.egress_with_source_security_group_id[1] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Allows HTTPS traffic to Private Subnet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTP from Everywhere IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTPS from Everywhere IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "Allows HTTP from Everywhere IPV6"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "Allows HTTPS from Everywhere IPV6"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment"  = "prod"
          + "Name"         = "prod-eip"
          + "Provisionner" = "Terraform"
        }
      + tags_all             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-eip"
          + "Provisionner" = "Terraform"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment"  = "prod"
          + "Name"         = "prod-igw"
          + "Provisionner" = "Terraform"
        }
      + tags_all = {
          + "Environment"  = "prod"
          + "Name"         = "prod-igw"
          + "Provisionner" = "Terraform"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment"  = "prod"
          + "Name"         = "prod-ngw"
          + "Provisionner" = "Terraform"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-ngw"
          + "Provisionner" = "Terraform"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-rt"
          + "Provisionner" = "Terraform"
        }
      + tags_all         = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-rt"
          + "Provisionner" = "Terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-rt"
          + "Provisionner" = "Terraform"
        }
      + tags_all         = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-rt"
          + "Provisionner" = "Terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.70.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment"  = "prod"
          + "Name"         = "prod-vpc"
          + "Provisionner" = "Terraform"
        }
      + tags_all                             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-vpc"
          + "Provisionner" = "Terraform"
        }
    }

Plan: 48 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @jonasfost, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*